# Sakila CodeAlong and Challenge

<img src='../Data/sakila-db-model.png'>

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

# ## Change username and password to match your personal MySQL Server settings
# username = 'root' # default username for MySQL db is root
# password = 'YOUR_PASSWORD' # whatever password you chose during MySQL installation.

# connection = f'mysql+pymysql://{username}:{password}@localhost/sakila'
# engine = create_engine(connection)

In [2]:
# import json
# with open('/Users/purvikansara/.secret/mysql.json') as f:
#     login = json.load(f)
# login.keys()

In [3]:
# login['username']

In [4]:
# connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/sakila"
# engine = create_engine(connection)

In [5]:
# create connection
username = "root"
password = "root"
db_name = "sakila"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [6]:
# create engine
engine = create_engine(connection)

In [7]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [8]:
# check engine
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [9]:
conn = engine.connect()

## Show the Tables

In [10]:
q = '''SHOW TABLES'''
pd.read_sql(q, conn)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3        bingo_talented_actors
4                     category
5                         city
6        city_id_312_customers
7                 comedy_films
8                      country
9                     customer
10               customer_list
11           customer_payments
12       customers_in_city_312
13                        film
14                  film_actor
15               film_category
16                 film_comedy
17                   film_list
18                   film_text
19                   inventory
20                    language
21          lollobrigida_films
22  nicer_but_slower_film_list
23                     payment
24                      rental
25      sales_by_film_category
26              sales_by_store
27                       staff
28                  staff_list
29                       store

## 1. What is the average length of films by category?

In [11]:
q = '''
SELECT category.name, AVG(length)
FROM film
JOIN film_category
    ON film.film_id = film_category.film_id
JOIN category
    ON film_category.category_id = category.category_id
GROUP BY category.name
ORDER BY AVG(length) DESC;
'''

pd.read_sql(q, conn)

           name  AVG(length)
0        Sports     128.2027
1         Games     127.8361
2       Foreign     121.6986
3         Drama     120.8387
4        Comedy     115.8276
5        Family     114.7826
6         Music     113.6471
7        Travel     113.3158
8        Horror     112.4821
9      Classics     111.6667
10       Action     111.6094
11          New     111.1270
12    Animation     111.0152
13     Children     109.8000
14  Documentary     108.7500
15       Sci-Fi     108.1967

In [12]:
# using alias AS
q = '''
SELECT c.name, AVG(length) AS avg_length
FROM film as f
JOIN film_category as fc
    ON f.film_id = fc.film_id
JOIN category AS c
    ON fc.category_id = c.category_id
GROUP BY c.name
ORDER BY avg_length DESC;
'''

pd.read_sql(q, conn)

           name  avg_length
0        Sports    128.2027
1         Games    127.8361
2       Foreign    121.6986
3         Drama    120.8387
4        Comedy    115.8276
5        Family    114.7826
6         Music    113.6471
7        Travel    113.3158
8        Horror    112.4821
9      Classics    111.6667
10       Action    111.6094
11          New    111.1270
12    Animation    111.0152
13     Children    109.8000
14  Documentary    108.7500
15       Sci-Fi    108.1967

## 2. Sales have been lagging among young families, and you wish to target all family movies for a promotion. Identify all movies categorized as family films.

In [13]:
q = '''
SELECT *
FROM category;
'''

pd.read_sql(q, conn)

    category_id         name         last_update
0             1       Action 2006-02-14 12:46:27
1             2    Animation 2006-02-14 12:46:27
2             3     Children 2006-02-14 12:46:27
3             4     Classics 2006-02-14 12:46:27
4             5       Comedy 2006-02-14 12:46:27
5             6  Documentary 2006-02-14 12:46:27
6             7        Drama 2006-02-14 12:46:27
7             8       Family 2006-02-14 12:46:27
8             9      Foreign 2006-02-14 12:46:27
9            10        Games 2006-02-14 12:46:27
10           11       Horror 2006-02-14 12:46:27
11           12        Music 2006-02-14 12:46:27
12           13          New 2006-02-14 12:46:27
13           14       Sci-Fi 2006-02-14 12:46:27
14           15       Sports 2006-02-14 12:46:27
15           16       Travel 2006-02-14 12:46:27

In [14]:
# identify all movies in the category family_films
q = '''
SELECT f.title AS 'family_movies'
FROM film AS f
JOIN film_category as fc
    ON f.film_id = fc.film_id
JOIN category AS c
    ON fc.category_id = c.category_id
WHERE c.name = 'Family';    
'''

pd.read_sql(q, conn)

       family_movies
0        AFRICAN EGG
1      APACHE DIVINE
2     ATLANTIS CAUSE
3    BAKED CLEOPATRA
4          BANG KWAI
..               ...
64       SPLASH GUMP
65      SUNSET RACER
66     SUPER WYOMING
67  VIRTUAL SPOILERS
68      WILLOW TRACY

[69 rows x 1 columns]

In [15]:
# using category_id = 8 as Family
q = '''
SELECT f.title AS 'family_movies'
FROM film as f
JOIN film_category as fc
    ON f.film_id = fc.film_id
JOIN category as c
    ON fc.category_id = c.category_id
WHERE c.category_id = '8';
'''

pd.read_sql(q, conn)

       family_movies
0        AFRICAN EGG
1      APACHE DIVINE
2     ATLANTIS CAUSE
3    BAKED CLEOPATRA
4          BANG KWAI
..               ...
64       SPLASH GUMP
65      SUNSET RACER
66     SUPER WYOMING
67  VIRTUAL SPOILERS
68      WILLOW TRACY

[69 rows x 1 columns]

## 3 You want to run an email marketing campaign in Canada, for which you will need the names and email addresses of all Canadian customers. Use joins to retrieve this information.

In [25]:
# check schema for order of joins
# customer => address => city => country
# first_name, last_name, email
# country = Canada
q = '''
SELECT c.first_name, c.last_name, c.email
FROM customer AS c
JOIN address AS a
    ON c.address_id = a.address_id
JOIN city AS ct
    ON a.city_id = ct.city_id
JOIN country AS ctry
    ON ct.country_id = ctry.country_id
WHERE country = 'Canada';
'''

pd.read_sql(q, engine)

  first_name  last_name                                 email
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org

# The following queries use subqueries

## 4. Find the customer's first and last name where the amount paid was greater than the average payment. Make sure to only show unique results.

In [27]:
# first_name, last_name
# amount > AVG(amount)
# DISTINCT
# not using AS for alias
q = '''
SELECT DISTINCT c.first_name, c.last_name
FROM customer c
JOIN payment p
    ON c.customer_id = p.customer_id
WHERE p.amount > (SELECT AVG(amount)
                  FROM payment);
'''

pd.read_sql(q, engine)

    first_name  last_name
0         MARY      SMITH
1     PATRICIA    JOHNSON
2        LINDA   WILLIAMS
3      BARBARA      JONES
4    ELIZABETH      BROWN
..         ...        ...
594   TERRENCE  GUNDERSON
595    ENRIQUE   FORSYTHE
596    FREDDIE     DUGGAN
597       WADE   DELVALLE
598     AUSTIN    CINTRON

[599 rows x 2 columns]

## 5. Find the total number of payments made by Mary Smith using subqueries.

In [32]:
# total # of pmt COUNT(*)
# first_name = Mary AND last_name = Smith
q = '''
SELECT COUNT(*) 'total_payments'
FROM payment
WHERE customer_id = (
    SELECT customer_id
    FROM customer
    WHERE first_name = 'Mary' AND last_name = 'Smith'
);
'''

pd.read_sql(q, engine)

   total_payments
0              32

## 6. Use subqueries to display all actors who appear in the film Alone Trip.

In [37]:
# check schema
# order by schema actor => (film_actor => film)
# film_actor first_name, last_name
# film_title = 'Alone Trip'
q = '''
SELECT a.first_name, a.last_name
FROM actor a
JOIN film_actor fa
    ON a.actor_id = fa.actor_id
WHERE fa.film_id = (
    SELECT f.film_id
    FROM film f
    WHERE f.title = 'Alone Trip'
);    
'''

pd.read_sql(q, engine)

  first_name last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP
5      CHRIS      DEPP
6   LAURENCE   BULLOCK
7      RENEE      BALL

<img src = '../Data/Challenge.jpg'>

## 1. What are the titles, categories, and lengths of all films in the Sakila database that are longer than 120 minutes? Put the films in order by length.

In [ ]:
q = '''

'''

pd.read_sql(q, engine)

## 2. What are the first names, last names, and film titles of all actors named 'Penelope' in the Sakila database?

In [ ]:
q = '''  '''

pd.read_sql(q, engine)

# The following queries must use Subqueries for the statement.

## 3. Who are the actors that have acted in the film with film_id = 1

In [ ]:
q = '''  '''

pd.read_sql(q, engine)

## 4. What are the films that are in the English Language

In [ ]:
q = '''  '''

pd.read_sql(q, engine)

## 5. Who are the customers that belong to the store managed by Mike Hillyer?

In [ ]:
q = '''  '''

pd.read_sql(q, engine)